c(1:5)#向量是最基础的，用c函数即可构建，类型有向量（特殊向量factor）、矩阵、数组、数据框、列表
c('hello')#字符型
c(123.123)#浮点数
c(1L)#整型
c(3+2i)#f复数
c(TRUE)#逻辑型
gender <- factor(c('a','b'))#因子
a <- matrix(1:30,nrow = 5,ncol = 6,byrow = FALSE,dimnames = list(
  c('one','two','three','four','five'),
  c('att','acc','ahh','all','auu','aqq')))#矩阵
data <- array(1:30,c(5,6,1),dimnames = list(
  c('one','two','three','four','five'),
  c('att','acc','ahh','all','auu','aqq')))#数组
table <- data.frame(
  班级=c('金工251','金科251'),
  学号=c('金丹','金晓明'),
  成绩=c('115','456')
)#数据框
lists <- list(c(1:5),123,'djfakj')#列表
class(data)#查看数据类型的函数
cxm <- c('a','b','c')
cxm[2]#按照序号提取元素
-------------------------------------------------------------
lists <- list(c(1:5),123,'djfakj',矩阵=matrix(c(1,2,3,4,5,6)))#列表可包含其他类型数据结构
lists[1]
lists$矩阵
lists[['矩阵']]
for (i in lists)print(i)#我知道的有四种
------------------------------------------------------------
table1 <- data.frame(
  班级=c('金工251','金科251'),
  学号=c('金丹','金晓明'),
  成绩=c('115','456'))#需要用到数据框，与向量的关系是数据框每一列数据都是向量，与列表的关系则是是一种特殊列表，可进行互转换
----------------------------------------------------------------
table2 <- data.frame(
  班级=c('金工251','金科251'),
  姓名=c('金丹','金晓明'),
  成绩=c(115,456))#与向量的关系是数据框每一列数据都是向量
list2 <- list(table)
list2#数据框转列表，但得保证向量长度一致
table3 <- list(
  班级=c('金工251','金科251'),
  姓名=c('金丹','金晓明'),
  成绩=c(115,456))
table4 <- data.frame(table3)
table4#列表转数据框，但得保证向量长度一致
